[
  {
    "street": "Mercer St (Between Westlake Ave N and Terry Ave N)",
    "artist": "Chuck Santon",
    "title": "Portal and Horizon for Four Doors",
    "image": "https://storefrontsseattle.files.wordpress.com/2015/12/santon_press.jpeg",
    "url": "http://storefrontsseattle.com/2015/12/03/eight-new-artists-on-display-in-south-lake-union/",
    "statement": "Portal and Horizon for Four Doors continues Santon's ongoing investigation of the experience of one's physical position in, and movement through, space. This particular work is about the loss of four people who were important to the artist and was partly inspired by the opening lines of Doors, a poem written in 1957 by Carl Sandburg: An open door says, \"Come in.\" A shut door says, \"Who are you?\" In Santon's own words: \"We confront doors day and night as we move through life; our horizons racing forward as they disappear behind us. Doors that separate outside from inside, past from future, liberty from captivity, gain from loss, dilemma from choice, joy from grief.\"",
    "latitude": "47.6245477",
    "longitude": "-122.3374588"
  },

  {
    "street": "Mercer St (Between Westlake Ave N and Terry Ave N)",
    "artist": "Julius Brown",
    "title": "The Image Maze",
    "image": "https://storefrontsseattle.files.wordpress.com/2015/12/brown_press.jpg?w=300&h=169",
    "url": "http://storefrontsseattle.com/2015/12/03/eight-new-artists-on-display-in-south-lake-union/",
    "statement": "Inspired by an online image gallery the artist created at the dawn of the world wide web. The Image Maze is comprised of multiple video projections and layers of fabric arranged in unique patterns. The work invites you to spend time with art, exploring and contemplating.",
    "latitude": "47.6245416",
    "longitude": "-122.3380861"
  },

  {
    "street": "Republican St (Between Boren Ave N and Terry Ave N)",
    "artist": "Kate Jessup",
    "title": "Exit, Muse",
    "image": "https://storefrontsseattle.files.wordpress.com/2015/12/jesssup_press.jpg?w=300&h=179",
    "url": "http://storefrontsseattle.com/2015/12/03/eight-new-artists-on-display-in-south-lake-union/",
    "statement": "This installation is the culmination of many points of interest in Kate Jessup's art practice; a literal and conceptual mosaic of mosaics. Of the piece, Jessup says \"In the same way that a novel is an arrangement of chapters or a city is a collection of communities, this piece weaves together many small stories with the intention of building a dynamic whole. Both as individual works and in the way they have coalesced, these mosaics are seeped in themes that never seem far from my work. Of particular interest to me is the network of binaries and balances that construct our world. Notions of love vs. fear, life vs. death, togetherness vs. aloneness, the organic vs. the constructed, entanglement vs. freedom, are all present here. The vortex arrangement arose almost of its own accord; a life cycle built of many experiences, constantly in motion and without beginning or end.\"",
    "latitude": "47.6232011",
    "longitude": "-122.3366286"
  },

  {
    "street": "Harrison St (Between Boren Ave N and Terry Ave N)",
    "artist": "Satpreet Kahlon",
    "title": "As We Are",
    "image": "https://storefrontsseattle.files.wordpress.com/2015/12/kahlon_press.jpg?w=300&h=175",
    "url": "http://storefrontsseattle.com/2015/12/03/eight-new-artists-on-display-in-south-lake-union/",
    "statement": "\"In a time when we document everything on social media, it may seem unnecessary to document more than we currently do in our daily lives, but often times, through the process of self-curation, we get lost in what we feel our lives should be rather than what they are\" writes Satpreet Kahlon.  Separately, all of the elements of Kahlon's installation represent a small section of what sits at the heart of the neighborhood, but combined in a large, public space, the elements create a textured, nuanced, and grassroots portrait of the vibrant community that exists within South Lake Union at this moment in time.",
    "latitude": "47.6220253",
    "longitude": "-122.3360894"
  },

  {
    "street": "Harrison St (Between Boren Ave N and Terry Ave N)",
    "artist": "Elise Koncsek",
    "title": "Our City",
    "image": "https://storefrontsseattle.files.wordpress.com/2015/12/koncsek_press.jpg?w=300&h=300",
    "url": "http://storefrontsseattle.com/2015/12/03/eight-new-artists-on-display-in-south-lake-union/",
    "statement": "According to Koncsek, the intention of Our City is \"to remind people that we are not confined within our city, but rather that our city is a vast forest of unique structures oﬀering the potential for exciting exploration. These walls are not our boundaries, they are twists and turns in our path to adventure.\" Our City comprises a series of human-like abstract wooden figures climbing and dancing through a model city made of wood and other local found and salvaged natural materials, to create a whimsical model cityscape.",
    "latitude": "47.6220293",
    "longitude": "-122.3363695"
  },

  {
    "street": "Thomas St (Between Boren Ave N and Terry Ave N)",
    "artist": "Sylwia Tur",
    "title": "Arsenal",
    "image": "https://storefrontsseattle.files.wordpress.com/2015/12/tur_press.jpg?w=300&h=225",
    "url": "http://storefrontsseattle.com/2015/12/03/eight-new-artists-on-display-in-south-lake-union/",
    "statement": "The \"Arsenal\" is composed of groupings of porcelain shapes, presented in a shelving system forming a grid. Each shelf box contains one type of shape, similar to how products are displayed in a store, especially a clothing store, where often clothes are neatly folded by type and color in stacking modular cubes. The artwork suggests an arsenal of shapes, a repertoire of possibilities, a language of objects. It evokes an image of a very unusual store display or a laboratory, full of neatly organized tools displayed on shelving grids.",
    "latitude": "47.6208648",
    "longitude": "-122.3363768"
  },

  {
    "street": "Thomas St (Between Boren Ave N and Terry Ave N)",
    "artist": "Jarvi Kononen",
    "title": "Drawing Colors From The Shifting Tide",
    "image": "https://storefrontsseattle.files.wordpress.com/2015/12/kononen_press.jpg?w=300&h=240",
    "url": "http://storefrontsseattle.com/2015/12/03/eight-new-artists-on-display-in-south-lake-union/",
    "statement": "This site-specific sculptural installation, mainly comprises cut paper, string and other basic materials to create a vibrantly colorful and abstract construction with line and shape informed by the elemental forces of the local landscape. The work addresses and contrasts the hard geometry of the cityscape with the organic and geologic forms of the larger landscape.",
    "latitude": "47.6208644",
    "longitude": "-122.3360966"
  },

  {
    "street": "John Street (Corner of Boren Ave N)",
    "artist": "Maximo DiDuro",
    "title": "Mise en Scene",
    "image": "https://storefrontsseattle.files.wordpress.com/2015/12/diduro_press.jpg?w=289&h=300",
    "url": "http://storefrontsseattle.com/2015/12/03/eight-new-artists-on-display-in-south-lake-union/",
    "statement": "The concept for this series by DiDuro is to use repurposed visuals, recycled pieces, and found objects to contrast with the newer location of the viewing space; creating a collage that evokes new life through the use of old materials. The theme of duality – focusing on positive and negative, light and dark, color and absence of color – is apparent, allowing the viewer to get a variety of different meanings from the series.",
    "latitude": "47.6197142",
    "longitude": "-122.3364153"
  }

]
