[
  {
    "street": "Mercer St (Between Westlake Ave N and Terry Ave N)",
    "artist": "Lauren Boillini",
    "title": "Love and War",
    "image": "https://storefrontsseattle.files.wordpress.com/2016/04/stickyfingers1-copy.jpg?w=300&h=200",
    "url": "https://storefrontsseattle.com/2016/04/01/shunpike-is-proud-to-present-the-work-of-eight-washington-state-artists-in-south-lake-union/",
    "statement": "Lauren Boillini's studio practice has consistently been large scale, mural-sized oil paintings, though she often works directly on the wall exploring painting as installation. The dimension of her work relates to the size of the human body and the potential for painting to physically overwhelm the viewer. She works directly on the wall as she experiments closely with the architecture, making paintings that engage floor to ceiling.",
    "latitude": "47.6245477",
    "longitude": "-122.3374588"
  },

  {
    "street": "Mercer St (Between Westlake Ave N and Terry Ave N)",
    "artist": "Naoko Morisawa",
    "title": "Evergreen Harvest/Green roots",
    "image": "https://storefrontsseattle.files.wordpress.com/2016/04/100_7179.jpg?w=300&h=225",
    "url": "http://storefrontsseattle.com/2015/12/03/eight-new-artists-on-display-in-south-lake-union/",
    "statement": "A garden hose is an everyday tool, but every time water runs inside it, the hose is active and seems to live for me. Morsiawa wanted to convey this sense of the material's alive-ness to the audience, and decided that an object made of hose tube looks having the life and this unique work should serve the purpose. Seattle based artist is known for her award-winning work in wood mosaic. Her artworks, made from thousands of very small slices of natural and oil-stained wood, explore imaginary of everyday natural and manufactured items, such as wave, waterfall, or shoes and abstraction. Morisawa currently developing a body of experimental work using other materials such as cardboard and garden hose.",
    "latitude": "47.6245416",
    "longitude": "-122.3380861"
  },

  {
    "street": "Harrison St (Between Boren Ave N and Terry Ave N)",
    "artist": "Claire Brandt",
    "title": "Fins",
    "image": "https://storefrontsseattle.files.wordpress.com/2016/04/finii_brandt_2011_300dpi_8in.jpg?w=238&h=300",
    "url": "https://storefrontsseattle.com/2016/04/01/shunpike-is-proud-to-present-the-work-of-eight-washington-state-artists-in-south-lake-union/",
    "statement": "Brandt grew up on Puget Sound and has always loved Orcas. They are a mysterious unknown that she has been aware of her whole life. This work is life-sized in order to make a physical relationship between viewer and animals, what does it feel like to be next to this body? Orcas posses multiple currents of meaning: their literal being, their very bigness and physical power; their otherness and intelligence versus their long and fraught history with humans; as well as their place in human imagination. This work is about power, and about the relationship to the other. Brandt is represented by the Bryan Ohno Gallery.",
    "latitude": "47.6220253",
    "longitude": "-122.3360894"
  },

  {
    "street": "Harrison St (Between Boren Ave N and Terry Ave N)",
    "artist": "Dulcinea Rattet",
    "title": "Colorscapes",
    "image": "https://storefrontsseattle.files.wordpress.com/2016/04/colorscape-ix.jpg?w=299&h=300",
    "url": "http://storefrontsseattle.com/2015/12/03/eight-new-artists-on-display-in-south-lake-union/",
    "statement": "Whether she is trying to capture a dream or embody an idea, Dulcinea Rattet's Colorscapes are a way of releasing her thoughts while simultaneously indulging in her lust for color. Sometimes her brushstrokes are methodical and cautious; other times they are visceral and uninhibited. This process is energizing; it allows the physical movements of the body to hold equal importance to the paintings. Rattet's mental space is often difficult to translate in words but easier to depict in color – these paintings transform that mental space into a physical space that can be shared with the viewer.",
    "latitude": "47.6220293",
    "longitude": "-122.3363695"
  },

  {
    "street": "Republican St (Between Boren Ave N and Terry Ave N)",
    "artist": "Laura Castellanos",
    "title": "Cake and Ashes",
    "image": "https://storefrontsseattle.files.wordpress.com/2016/04/bigheadshot.jpg?w=199&h=200",
    "url": "https://storefrontsseattle.com/2016/04/01/shunpike-is-proud-to-present-the-work-of-eight-washington-state-artists-in-south-lake-union/",
    "statement": "\"Cake and Ashes\" is a series of stuffed sculptures, created from hand-me-downs such as used pillow cases, bed sheets and second hand clothing. Castellanos finds that conjuring with cast off and discarded materials serves my cultural upbringing where resourcefulness was part of my early childhood experience. This approach along with practicing a kind of “kinetic thinking” allows her work to evolve according to its own logic. In this way, she can anticipate unfamiliar characters to take form, nurture them along and then hopefully, find each one emerging with its own unique sense of wonder.",
    "latitude": "47.6232011",
    "longitude": "-122.3366286"
  },

  {
    "street": "Thomas St (Between Boren Ave N and Terry Ave N)",
    "artist": "Aaliyah Gupta",
    "title": "Flight",
    "image": "https://storefrontsseattle.files.wordpress.com/2016/04/gupta-from-here-to-there.jpg?w=300&h=200",
    "url": "http://storefrontsseattle.com/2015/12/03/eight-new-artists-on-display-in-south-lake-union/",
    "statement": "Movement has been a recurring theme in Gupta's work over the last few years. Most recently she has been intrigued by swarms, the movement of huge numbers of birds, insects and other creatures that move through space in coordinated yet unpredictable ways. Watching murmurations of starlings move through the air, dipping and weaving, swooping and rising up, as if they shared a collective brain made her wonder how they achieved this uniformity of movement. Swarm research shows that some rules allow for this collective decision making – attraction, repulsion and alignment – and that these simple rules can produce complex behaviors. In large groups, individuals look at what their neighbors are doing and follow their leads, and have to balance staying with the group as well as moving in a desired direction. Researchers have found that just a few leaders are need to guide a swarm effectively. No special signals are sent out, rather their movement biases the movement of the individuals that make up the swarm. We see mass migrations in nature on a daily basis, as birds, insects, and other creatures travel long distances seeking food, warmth and mating grounds. These days, human migration is making headlines every day as large numbers of displace people are traveling huge distances at great risk, seeking shelter and safety from war, violence and oppression.",
    "latitude": "47.6208648",
    "longitude": "-122.3363768"
  },

  {
    "street": "Thomas St (Between Boren Ave N and Terry Ave N)",
    "artist": "Caroline Rousseau",
    "title": "The Butterfly Project",
    "image": "https://storefrontsseattle.files.wordpress.com/2016/04/image6.jpg?w=277&h=300",
    "url": "http://storefrontsseattle.com/2015/12/03/eight-new-artists-on-display-in-south-lake-union/",
    "statement": "\"The Butterfly Project\" is a small, fun presentation and preservation that captures the idea of beauty in nature and celebrated memories at the same time. These small works remind Rousseau of summer days and the delicate beauty of butterflies darting about – fragile and beautiful, like memories of celebrations she doesn't want to ever forget. The idea of that movement reveals an inherent grace and awkwardness at the same time, a lightness and love for our own vulnerabilities and past shared memories.",
    "latitude": "47.6208644",
    "longitude": "-122.3360966"
  },

  {
    "street": "John Street (Corner of Boren Ave N)",
    "artist": "P. Calavara",
    "title": "(a crowd of) Bopes, 2016",
    "image": "https://storefrontsseattle.files.wordpress.com/2016/04/jb_1.jpg?w=300&h=218",
    "url": "http://storefrontsseattle.com/2015/12/03/eight-new-artists-on-display-in-south-lake-union/",
    "statement": "This piece features a style of artwork and personage that the artists refer to as “The Bopes.” The Bopes are the Calavara twins' (current) preferred method for commenting on the absurdities of modern life, which sounds really passé, but is still better than just saying that they like drawing silly cartoon characters drinking coffee. The Bopes have featured on coffee mugs, shirts, installations, and the Random Excuse Generator at AllGoodExcuses.com.",
    "latitude": "47.6197142",
    "longitude": "-122.3364153"
  }
]
