[{"street":"John St, west of Boren Ave N","artist":"Diana Surma, Judd Cohen and Erik Rosenbladt","title":"ColorBox","image":"https://storefrontsseattle.files.wordpress.com/2015/03/01_cohen_judd_colorbox_render.jpg?w=650&h=366","url":"http://storefrontsseattle.com/2015/03/19/eight-new-storefronts-for-spring-in-south-lake-union/","statement":"ColorBox is a project that challenges the typical relationship between viewer and artwork by inviting interaction between the audience and surrounding environment. The sculpture aims to encourage curiosity and direct, tangible engagement with passerby. It’s essential purpose is to evoke speculation and wonder in regards to the origin of its dynamic, ever changing grid of color.","bio":"Diana Leigh Surma is an abstract painter influenced by color theory, pattern and color field painting. Judd Cohen is a sculptor, programmer and game designer. Erik Rosenbladt is a tinkerer, collector and electronics guru. We are a Tacoma-based artist team interested in combining fine art techniques with digital media to produce interactive 3-D installations. Through collaboration, we aim to promote a more widespread integration of arts and technology.","latitude":"47.61982","longitude":"-122.33607"},{"street":"Mercer St, west of Terry Ave N","artist":"Rachel Dorn","title":"Kekino Bionica","image":"https://storefrontsseattle.files.wordpress.com/2015/03/dornimg_6419.jpeg","url":"http://storefrontsseattle.com/2015/03/19/eight-new-storefronts-for-spring-in-south-lake-union/","statement":"Rachel Dorn creates ceramic sculptures that are a surreal interpretation of the biological world, featuring abstract forms inspired by exotic and local plants, including seed pods, bulbs and flowers, as well as aquatic creatures. In her most recent work, mechanical parts are integrated into the sculptures as prosthetic supports and enhancements for the organic forms both familiar and strange.","bio":"Rachel Dorn is a ceramic sculptor and art instructor based in Yakima, WA, where she teaches clay and studio art classes at Yakima Valley Community College.","latitude":"47.624417533364316","longitude":"-122.33765602111816"},{"street":"Mercer St, west of Terry Ave N","artist":"Dakota Gearhart","title":"Imaging Andromeda","image":"https://storefrontsseattle.files.wordpress.com/2015/03/gearhart_d_02-copy.jpg?w=650&h=433","url":"http://storefrontsseattle.com/2015/03/19/eight-new-storefronts-for-spring-in-south-lake-union/","statement":"<p>Dakota Gearhart’s photographic sculpture speaks to pictures that will never be taken and sights that will never be seen, especially within the new frontier of space photography. Made from collaged images of the cosmos culled from NASA, the photos are then adhered together and painted over with the artist’s interpretation of the Andromeda Galaxy.</p><p>Our scientific images of the cosmos are more or less fake photographs – intensively color corrected, cropped, translated, compressed, and composited by a team of artists and scientists at NASA. This done so that we can interpret information which otherwise would appear blurry, blown out, and static-like to the cones and rods of our human eyes.</p><p>In this way, the NASA mission of photographing the cosmos becomes an expression of aesthetic power, not unlike the practices of early landscape photographers in the late nineteenth century. In both cases, when a select group of people create photographs that the public interprets as “real” or “fact” it opens up doors for the misunderstanding of peoples, lands, practices, and now, the vast beyond. These slippery patterns in image-making are concerning, as they speak to a history of commodifying the foreign through the truth-like quality of a photograph.</p><p>Seeking to reconstruct a version of the Andromeda Galaxy, the artist challenges what we assume about the unknown dimensions of outer space as we look at stock images of the cosmos, as well as a way to imagine what is unknowable and un-photographable.","bio":"Dakota Gearhart is a multi-media artist working in sculpture, video, light, and installation, questioning systems of human desire and environmental consumption through the lens of fantastical narrative. Dakota has exhibited work both nationally and internationally in venues such as Henry Art Gallery, Seattle; FalseFront Gallery, Portland; Vulpes Vulpes, London; and Taiyuan Normal University Gallery, Shanxi. She is the recipient of the Artist Trust Project Grant, the Jane & David Davis Fellowship, and the Cultural Ambassador Scholarship from the Spanish Ministry of Education. Dakota lives and works in Seattle, WA, where she recently graduated with her MFA from the University of Washington.","latitude":"47.62443199556771","longitude":"-122.33731269836424"},{"street":"Republican St, west of Boren Ave N","artist":"Rickie Wolfe","title":"Under the Big Tent","image":"https://storefrontsseattle.files.wordpress.com/2015/03/wolfe31lanternsdet3-copy.jpg?w=488&h=650","url":"http://storefrontsseattle.com/2015/03/19/eight-new-storefronts-for-spring-in-south-lake-union/","statement":"Rickie Wolfe’s multi media work is rooted in an interest in process and the investigation of structure. After forging circles and curvilinear pieces of metal, she looks for compositional interest, line width, and a certain emotional response. The metal skeleton is fully realized when I recognize a balance between buoyancy and weight. For me, the beauty of the shadows is always striking, important, and enjoyable when lighting a show. Taking the step to capture the shadows on paper has been an important shift in my art practice. My Storefront has come at this exciting crossroads as I continue to explore the relationship between my mediums.","bio":"Rickie Wolfe lives, works, and teaches in Seattle Washington where she has a studio practice in printmaking, sculpture, and painting. She is represented by Fresh Paint Art in Los Angeles, California and Gallery IMA in Seattle where she will have a solo exhibition in October of this year. Wolfe received her BFA from Cornish College of the Arts.","latitude":"47.623144843796936","longitude":"-122.33645439147949"},{"street":"Harrison St, west of Boren Ave N","artist":"Aitana de la Jara","title":"The 99 Critical Shots in Pool","image":"https://storefrontsseattle.files.wordpress.com/2015/03/04-de-la-jara.jpg?w=341&h=650","url":"http://www.aitanadelajara.com/","statement":"The paintings and drawings of The 99 Critical Shots in Pool take as a starting point the marks that pool players make on the pool cloth during practice to recreate over and over again the same ball configuration to perfect a shot. These traces create a record of a struggle that the player has with himself, which are parallel to the way the marks on canvas or paper create a record of how an artist struggles with the materials and ideas of art. In essence, what happens on the pool cloth, and the marks left on it, have become for me a metaphor for a private struggle to break through one’s own personal limitations. The pool cloths in this series depict a struggle between reality and potential.</p><p>This work would not have been possible without the generosity of Rich Geiler, a top pool player in the Pacific Northwest, who provided the used pool cloths.","bio":"Born in Alicante, Spain, Aitana de la Jara moved to the San Francisco Bay area as a child, studied painting at Yale, and later received an MFA in painting from the University of Washington. After spending a few years of intense painting and isolation in Southern Utah and Italy, thanks to a Fulbright grant, the artist now resides in Seattle.","latitude":"47.621958900629956","longitude":"-122.33636856079102"},{"street":"Harrison St, west of Boren Ave N","artist":"k burnley","title":"Elusive/Illusive","image":"https://storefrontsseattle.files.wordpress.com/2015/03/rooms-orange.jpg?w=650&h=366","url":"http://www.kburnley.com/","statement":"<i>Illusive/Elusive</i> is an installation exploring the fruitless ways we try to frame the past and our relationship with it. Memories naturally distance themselves from us with time: whether they make room for new ones or we merely just get older and start to forget. Some research states that we truly never forget anything, it is always stored away somewhere in our brains and it’s just the process of accessing it that proves to be the problem.</p><p><i>Illusive/Elusive</i> creates a neuron-like web to represent memories and thoughts that overlap to create a complete idea. By adding a “frame” to the installation – one that can only be assumed and never truly seen as whole – the installation becomes a “false” representation of what is there. Elusive is what’s always on the horizon. Elusive is the dream where you never catch the flight. The idea of “illusive” is negative. It’s trickery and deception. It plays on what one thinks is reality. Memories exists as both elusive and illusive.","bio":"k burnley is an artist who lives and works in Seattle, WA. Both her photographic and installation work addresses where memory and reality meet and where they diverge – often in a muted color palette. Her work has been featured in exhibitions in Brooklyn and Seattle. She earned her BFA in photography from the Maryland Institute College of Art in 2007.","latitude":"47.62192997485076","longitude":"-122.3360252380371"},{"street":"Thomas St, west of Boren Ave N","artist":"Katherine Noel","title":"Fairy Tale Book Sculptures","image":"https://storefrontsseattle.files.wordpress.com/2015/03/noel-unnamed.jpg?w=650&h=487","url":"http://cargocollective.com/katherinechristmas","statement":"Katherine Noel’s work offers tangible, three-dimensional illustrations of classic fairy tales. The images are ones we all know, but don’t often see off the page itself. Through a combination of book art and sculpture, these dioramas take the notion of a pop-up book one step further. The delicately detailed representations carry a weight and movement that brings the stories of childhood beyond the book’s binding.","bio":"Noel studied visual art and English at Duke University with a strong interest in sculpture and photography. She now lives in Seattle and designs and installs window displays downtown.","latitude":"47.62097541515849","longitude":"-122.33654022216795"},{"street":"Thomas St, west of Boren Ave N","artist":"Ellen DiCola","title":"Was Here","image":"https://storefrontsseattle.files.wordpress.com/2015/03/best_smoke-farm_day.jpg?w=650&h=488","url":"http://storefrontsseattle.com/2015/03/19/eight-new-storefronts-for-spring-in-south-lake-union/","statement":"Ellie DiCola works from the perspective of the unapologetically female, using video, performance, online media, sculpture and experimental poetics. Utilizing highly autobiographical content and overtly feminine tropes, she speaks to broader questions about gender, identity and feminism. Performing secular ritual such as tending to houseplants, preparing/consuming food, and maintaining a diary through video blogging, is a way to explore the overlap of desire and futility, the pull between embodiment and disembodiment. The artist draws from symbolism related to mystic traditions, such as spell-casting, as well as the Catholic trinity and sacrament, to explore the nature of belief and representation. DiCola creates work that aesthetically hovers between sensuous tactility and a broader digital/virtual lens, through which it’s ultimately presented.","bio":"Ellie Dicola is an interdisciplinary artist and writer based in Seattle. Ellie received an MFA in studio art from the San Francisco Art Institute. Her work has recently been presented at On The Ground Floor (Los Angeles),Seattle University’s Hedreen Gallery, the Henry Art Gallery Test Site, with Present Company in Brooklyn, and in a variety of alternative formats and venues on the west coast. She is a Contributing Writer for Art Nerd City Guides: Art Nerd Seattle.","latitude":"47.62101880461351","longitude":"-122.3362612724304"}]